app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "awef"], ["created_at", "2015-09-23 04:21:11.678816"], ["updated_at", "2015-09-23 04:21:11.678816"]]
---
  def create
    @user = User.new
    @user.name = params[:user][:name]
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 34]]
UPDATE "users" SET "name" = $1, "email_address" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "matt"], ["email_address", "matt@alumni.reed.edu"], ["updated_at", "2015-09-24 19:43:54.010137"], ["id", 41]]
---
  def update
    @user = User.find(params[:id])
    if @user
      if params[:user][:name] #check if i need this double-if checker or not
        #am doing this b/c sometimes will only have :name or :status in params
        @user.name = params[:user][:name]
      end
      if params[:user][:status]
        @user.status = params[:user][:status]
      end
      @user.save